module Constants

# ルール
SPLATOON_RULE = [
  "ガチエリア",
  "ガチヤグラ",
  "ガチホコ"
]

# ステージ
SPLATOON_STAGE = [
  "デカライン高架下",
  "ハコフグ倉庫",
  "シオノメ油田",
  "アロワナモール",
  "Bバスパーク",
  "ホッケふ頭",
  "モズク農園",
  "ネギトロ炭鉱",
  "タチウオパーキング",
  "モンガラキャンプ場",
  "ヒラメが丘団地",
  "マサバ海峡大橋",
  "キンメダイ美術館",
  "マヒマヒリゾート&スパ",
  "ショッツル鉱山",
  "アンチョビットゲームズ"
]

# ブキ
SPLATOON_WEAPONS = [

  # シューター
  "わかばシューター",
  "もみじシューター",
  "スプラシューター(ヒーローシューターレプリカ)",
  "スプラシューターコラボ(オクタシューターレプリカ)",
  ".52ガロン",
  "N-ZAP85",
  "シャープマーカー",
  "プロモデラーMG",
  "N-ZAP89",
  "ジェットスイーパー",
  "L3リールガン",
  "シャープマーカーネオ",
  "H3リールガン",
  "プライムシューター",
  ".52ガロンデコ",
  ".96ガロン",
  "ボールドマーカー",
  "L3リールガンD",
  "プロモデラーRG",
  ".96ガロンデコ",
  "H3リールガンD",
  "ジェットスイーパーカスタム",
  "デュアルスイーパー",
  "デュアルスイーパーカスタム",
  "ボールドマーカーネオ",
  "H3リールガンチェリー",
  "N-ZAP83",
  "スプラシューターワサビ",
  "プライムシューターコラボ",
  "プライムシューターベリー",
  "プロモデラーPG",
  "ボールドマーカー7",

  # ブラスター
  "ホットブラスター",
  "ノヴァブラスター",
  "ラピッドブラスター",
  "ロングブラスター",
  "ノヴァブラスターネオ",
  "Rブラスターエリート",
  "ホットブラスターカスタム",
  "ロングブラスターカスタム",
  "ラピッドブラスターデコ",
  "Rブラスターエリートデコ",
  "ロングブラスターネクロ",

  # ローラー
  "スプラローラー(ヒーローローラーレプリカ)",
  "スプラローラーコラボ",
  "カーボンローラー",
  "カーボンローラーデコ",
  "ダイナモローラー",
  "スプラローラーコロコロ",
  "ダイナモローラーテスラ",
  "ダイナモローラーバーンド",

  # フデ
  "パブロ",
  "パブロ・ヒュー",
  "ホクサイ",
  "ホクサイ・ヒュー",
  "パーマネント・パブロ",

  # チャージャー
  "スプラチャージャー(ヒーローチャージャーレプリカ)",
  "スプラチャージャーワカメ",
  "スクイックリンα",
  "スクイックリンβ",
  "スプラスコープ",
  "14式竹筒銃・甲",
  "14式竹筒銃・乙",
  "スプラスコープワカメ",
  "リッター3K",
  "3Kスコープ",
  "リッター3Kカスタム",
  "14式竹筒銃・丙",
  "3Kスコープカスタム",
  "スクイックリンγ",
  "スプラスコープベントー",
  "スプラチャージャーベントー",

  # スロッシャー
  "バケットスロッシャー",
  "ヒッセン",
  "バケットスロッシャーデコ",
  "スクリュースロッシャー ",
  "ヒッセン・ヒュー",
  "スクリュースロッシャーネオ",
  "バケットスロッシャーソーダ",

  # スピナー
  "バレルスピナー",
  "スプラスピナー",
  "バレルスピナーデコ",
  "スプラスピナーコラボ",
  "ハイドラント",
  "スプラスピナーリペア",
  "ハイドラントカスタム",
  "バレルスピナーリミックス"
]

# サブウェポン
SPLATOON_SUB_WEAPONS = [
  "スプラッシュボム",
  "キューバンボム",
  "クイックボム",
  "チェイスボム",
  "ポイズンボール",
  "ポイントセンサー",
  "トラップ",
  "スプリンクラー",
  "スプラッシュシールド",
  "ジャンプビーコン"
]

# スペシャルウェポン
SPLATOON_SPECIAL_WEAPONS = [
  "スーパーショット",
  "メガホンレーザー",
  "トルネード",
  "バリア",
  "ボムラッシュ",
  "ダイオウイカ",
  "スーパーセンサー"
]

# ギアパワー(共通)
SPLATOON_GEAR_POWER_COMMON = [
  "攻撃力アップ",
  "防御力アップ",
  "インク効率アップ(メイン)",
  "インク効率アップ(サブ)",
  "インク回復力アップ",
  "ヒト移動速度アップ",
  "イカダッシュ速度アップ",
  "スペシャル増加量アップ",
  "スペシャル減少量ダウン",
  "スペシャル時間延長",
  "復活時間短縮",
  "スーパージャンプ時間短縮",
  "ボム飛距離アップ"
]

# ギアパワー(アタマ専用)
SPLATOON_GEAR_POWER_HEAD = [
  "スタートダッシュ",
  "ラストスパート",
  "逆境強化",
  "カムバック"
]

# ギアパワー(フク専用)
SPLATOON_GEAR_POWER_BODY = [
  "マーキングガード",
  "イカニンジャ",
  "うらみ",
  "スタートレーダー"
]

# ギアパワー(クツ専用)
SPLATOON_GEAR_POWER_FOOT = [
  "ボムサーチ",
  "安全シューズ",
  "ステルスジャンプ"
]

end
